--Лабораторна робота №1
--Виконав Студент групи АнД-31
--Майданик Андрій Олександрович,Варіант №7
-- Мета - Ознайомитись з основними типами мови. Ознайомитись зi структурою та функцiями 
-- Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором ghci та визначення найпростiших функцiй.

--Завдання №1.Наведiть приклади виразiв вказаного типу.(String,([Bool],[Integer]))
 --[("good,well,done",True),("bad,worse,terrible",False),[1.3,1.4,0.3]]

 --Завдання №2 Функцiя приймає два числа i перевiряє, чи вони впорядкованi за зростанням.
 -- /Users/andreymaydanik/Desktop/FIT/НП/LR1

function1 :: Integer -> Integer -> Bool
function1  x1 x2 = x1 <= x2



-- Висновок:Під час виконання лабораторної роботи,я вивичив структуру та декілька функцій Haskell.Та написав одну функцію,
-- яка перевіряє,чи впорядковані два числа.
